{"title":"How To Wake Up at 5 A.M. Every Day","uid":"040f1890fd77d7a095b5d7a075cdec97","slug":"How-To-Wake-Up-at-5-A.M.-Every-Day","date":"2022-04-26T08:21:40.000Z","updated":"2022-04-26T08:50:52.782Z","comments":true,"path":"api/articles/How-To-Wake-Up-at-5-A.M.-Every-Day.json","keywords":"博客","cover":null,"content":"<p><strong>——An unconventional and compassionate guide to becoming an early bird</strong></p>\n<p>I thought I was destined to be a night owl forever.</p>\n<p>I’m no stranger to reading about the benefits of waking up early or having  the same sleeping routine — all of us have probably read this at some  point in our lives. I’m in my final semester of university, so the past  few years of my life have been absolute chaos. I have classes some days, work other days, and have free time on especially rare days. Having a  routine seemed impossible.</p>\n<p>But a few months ago, I started reading <a href=\"https://en.wikipedia.org/wiki/Haruki_Murakami\">Haruki Murakami</a>’s novels. My favorite is <a href=\"https://www.goodreads.com/book/show/11297.Norwegian_Wood\">Norwegian Wood</a>. Inspired by Murakami’s fascinating prose, I researched him a little.</p>\n<p>I found this gem in a <a href=\"https://www.theparisreview.org/interviews/2/haruki-murakami-the-art-of-fiction-no-182-haruki-murakami\">2004 interview</a> he did:</p>\n<blockquote><span class=\"custom-blockquote-svg\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"\" xmlns=\"http://www.w3.org/2000/svg\" data-reactroot=\"\">\n<path fill=\"\" d=\"M22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22C13.8 22 15.5 21.5 17 20.6L22 22L20.7 17C21.5 15.5 22 13.8 22 12Z\" undefined=\"1\"></path>\n<path fill=\"\" d=\"M15.97 11.5H16.04C17.12 11.5 18 12.38 18 13.47V13.53C18 14.62 17.12 15.5 16.03 15.5H15.96C14.88 15.5 14 14.62 14 13.53V13.46C14 12.38 14.88 11.5 15.97 11.5Z\" undefined=\"1\"></path>\n<path fill=\"\" d=\"M7.97 11.5H8.04C9.12 11.5 10 12.38 10 13.47V13.53C10 14.62 9.12 15.5 8.03 15.5H7.97C6.88 15.5 6 14.62 6 13.53V13.46C6 12.38 6.88 11.5 7.97 11.5Z\" undefined=\"1\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M17 8.5C15.23 8.97 14.07 10.84 14.01 13.27C14 13.33 14 13.4 14 13.47V13.5\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M9 8.5C7.23 8.97 6.07 10.84 6.01 13.27C6 13.33 6 13.4 6 13.47V13.5\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M15.97 11.5H16.04C17.12 11.5 18 12.38 18 13.47V13.53C18 14.62 17.12 15.5 16.03 15.5H15.96C14.88 15.5 14 14.62 14 13.53V13.46C14 12.38 14.88 11.5 15.97 11.5Z\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M7.97 11.5H8.04C9.12 11.5 10 12.38 10 13.47V13.53C10 14.62 9.12 15.5 8.03 15.5H7.97C6.88 15.5 6 14.62 6 13.53V13.46C6 12.38 6.88 11.5 7.97 11.5Z\"></path>\n</svg>\n</span><p>When I’m in writing mode for a novel, I get up at 4 a.m. and work for  five to six hours. In the afternoon, I run for ten kilometers or swim  for fifteen hundred meters (or do both), then I read a bit and listen to some music. I go to bed at 9 p.m.</p>\n<p>I keep to this routine every day without variation. The repetition  itself becomes the important thing; it’s a form of mesmerism. I  mesmerize myself to reach a deeper state of mind.</p>\n<p>But to hold to such repetition for so long — six months to a year —  requires a good amount of mental and physical strength. In that sense,  writing a long novel is like survival training. Physical strength is as  necessary as artistic sensitivity.</p></blockquote>\n<p>There’s something about the way Murakami talks about his routine that moved me. This part, in particular, stood out to me:</p>\n<p><em><strong>The repetition itself becomes the important thing; it’s a form of mesmerism.</strong></em></p>\n<p>Mesmerism has been a part of my life since I was a child; it’s the sense I have  every time I establish a new habit. I mesmerized myself as a child to  brush my teeth every day in the morning. As an adult, I’ve mesmerized  myself to be healthy by exercising regularly. I’ve mesmerized myself to  reflect on my life by adding a journaling routine.</p>\n<p>A surge of motivation struck me, knowing I had done a similar task in the past. I could become an early bird by mesmerizing myself.</p>\n<p>For the past 3 months, I’ve successfully transitioned into being an early  bird. I go to sleep at 9 p.m. on average 6-7 nights a week. I currently  wake up between 5–5:30 a.m. naturally.</p>\n<p>I might continue experimenting with waking up even earlier, but I’m happy with my current routine and don’t want to put too much pressure on  myself. After all, it’s healthy to get 8 hours of sleep, isn’t it?</p>\n<p>I’ve tried to become an early bird many times in my life and this is the  first time it has actually worked. Here’s what this process of  “mesmerizing” myself looked like—and also a few words about what doesn’t work.</p>\n<p>What really worked was more gentle than you might expect. Consider this, then, a compassionate guide to waking up early.</p>\n<p>…</p>\n<h5 id=\"Clarify-Your-Purpose-for-Waking-Up-Early\"><a href=\"#Clarify-Your-Purpose-for-Waking-Up-Early\" class=\"headerlink\" title=\"Clarify Your Purpose for Waking Up Early\"></a>Clarify Your Purpose for Waking Up Early</h5><p>Waking up before everyone else is tough. If you don’t have a reason to do it, you won’t do it.</p>\n<p>I don’t just mean purpose in the sense that you want to wake up to do  something. Of course, you’re going to wake up early to do something  (probably productive). But you need a purpose that extends past a basic  task.</p>\n<p>I’m about to graduate from university and I’m about to enter arguably the  most important years of my life — years where I’ll have both money and  freedom. If I ever want a chance at escaping at the 9–5, I have to do  something now. Working in the morning is easier than working at night,  so I need to set up my habits now so I can be living that life later.</p>\n<p>You might already have a purpose, but if you don’t, try running a <a href=\"https://en.wikipedia.org/wiki/5_Whys\">5 Whys</a> analysis (otherwise known as root cause analysis).</p>\n<p>To do the <em>5 Whys</em>:</p>\n<ol>\n<li>Form a problem statement.</li>\n<li>Ask the question: “Why is&#x2F;are&#x2F;does [your problem statement]?”. Use your answer as the next problem statement.</li>\n<li>Keep asking “why” until you’ve asked it five or more times.</li>\n</ol>\n<p>Example:</p>\n<blockquote><span class=\"custom-blockquote-svg\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"\" xmlns=\"http://www.w3.org/2000/svg\" data-reactroot=\"\">\n<path fill=\"\" d=\"M22 12C22 6.5 17.5 2 12 2C6.5 2 2 6.5 2 12C2 17.5 6.5 22 12 22C13.8 22 15.5 21.5 17 20.6L22 22L20.7 17C21.5 15.5 22 13.8 22 12Z\" undefined=\"1\"></path>\n<path fill=\"\" d=\"M15.97 11.5H16.04C17.12 11.5 18 12.38 18 13.47V13.53C18 14.62 17.12 15.5 16.03 15.5H15.96C14.88 15.5 14 14.62 14 13.53V13.46C14 12.38 14.88 11.5 15.97 11.5Z\" undefined=\"1\"></path>\n<path fill=\"\" d=\"M7.97 11.5H8.04C9.12 11.5 10 12.38 10 13.47V13.53C10 14.62 9.12 15.5 8.03 15.5H7.97C6.88 15.5 6 14.62 6 13.53V13.46C6 12.38 6.88 11.5 7.97 11.5Z\" undefined=\"1\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M17 8.5C15.23 8.97 14.07 10.84 14.01 13.27C14 13.33 14 13.4 14 13.47V13.5\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M9 8.5C7.23 8.97 6.07 10.84 6.01 13.27C6 13.33 6 13.4 6 13.47V13.5\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M15.97 11.5H16.04C17.12 11.5 18 12.38 18 13.47V13.53C18 14.62 17.12 15.5 16.03 15.5H15.96C14.88 15.5 14 14.62 14 13.53V13.46C14 12.38 14.88 11.5 15.97 11.5Z\"></path>\n<path stroke-linejoin=\"round\" stroke-linecap=\"round\" stroke-miterlimit=\"10\" stroke-width=\"2\" stroke=\"\" d=\"M7.97 11.5H8.04C9.12 11.5 10 12.38 10 13.47V13.53C10 14.62 9.12 15.5 8.03 15.5H7.97C6.88 15.5 6 14.62 6 13.53V13.46C6 12.38 6.88 11.5 7.97 11.5Z\"></path>\n</svg>\n</span><p><strong>I want to wake up at 5 a.m. every day.</strong></p>\n<p>Why do you want to wake up at 5 a.m. every day?</p>\n<p><strong>I want more time to be productive.</strong></p>\n<p>Why do you want to be more productive?</p>\n<p><strong>I want to practice writing.</strong></p>\n<p>Why do you want to practice writing?</p>\n<p><strong>I want to write books.</strong></p>\n<p>Why do you want to write books?</p>\n<p><strong>I want to have a career doing something creative.</strong></p>\n<p>Why do you want to have a career doing something creative?</p>\n<p><strong>I imagine it to be the most fulfilling thing someone can do in their career.</strong></p></blockquote>\n<p>Starting with a smaller problem and going deep to find the root cause helps you  gain a better understanding of what you really want. It’ll help you  understand if waking up is part of the solution to your problem.</p>\n<p>Waking up early gives you a few hours every day in the morning where nobody  else is going to disturb you. That’s all it is for most of us. For me,  though, that’s an important part of my solution to escaping a 9–5 rut  and doing work I love.</p>\n<p>…</p>\n<h5 id=\"Understand-What-You-Gain-and-Lose\"><a href=\"#Understand-What-You-Gain-and-Lose\" class=\"headerlink\" title=\"Understand What You Gain and Lose\"></a>Understand What You Gain and Lose</h5><p>When I first tried to become an early riser, I didn’t consider what I have  to give up. I failed because I wasn’t willing to give up the things I  enjoyed, like my weekday social life. I would go out, say I’d wake up  early despite getting home late, and ultimately wake up late.</p>\n<p>If you accept what you lose upfront, you won’t keep trying to hold onto it when it’s gone.</p>\n<p>But let’s be optimistic and start with what you’ll gain.</p>\n<h6 id=\"What-are-you-gain\"><a href=\"#What-are-you-gain\" class=\"headerlink\" title=\"What are you gain?\"></a>What are you gain?</h6><p>Being an early bird means you get a few hours every day to do whatever you  want. It’s likely nobody else will be awake to disturb you. You can  paint, start a business, write — anything you want.</p>\n<p>Your prefrontal cortex is most active right after waking up, making it  optimal for creativity. I’ve noticed I write much faster in the morning  than at any other time in the day. Looking at the habits of famous  writers, a lot of them have figured it out too (most authors write in  the morning).</p>\n<p>It’s a big win: a few hours of solitude with your most creative self.</p>\n<h6 id=\"What-are-you-lose\"><a href=\"#What-are-you-lose\" class=\"headerlink\" title=\"What are you lose?\"></a>What are you lose?</h6><p>There’s no free lunch. Waking up early doesn’t give you extra time. It takes  off time you would otherwise have at night — unless you sleep less,  which is a bad idea. If you sleep less, you either won’t be able to wake up early and become a night owl again, or you’ll be sleep-deprived and  unproductive throughout the day.</p>\n<p>In reality, I lost time since I started waking up early. I used to sleep  for 6 hours and wake up from the urgency to get up and get to work. I  can’t do that when I’m waking up early because there’s no urgency for me to get out of bed; I’m weak. So I sleep for 8 hours. Otherwise, the  temptation to stay in bed would be too much.</p>\n<p>I’ve lost around 2 hours every day—but I feel rested throughout the day.</p>\n<h6 id=\"Running-out-of-time\"><a href=\"#Running-out-of-time\" class=\"headerlink\" title=\"Running out of time\"></a>Running out of time</h6><p>I finish work at 5 p.m. (haha, 9–5). That means I have 4 hours after work before I sleep. But there are a few things I need to do within that  time:</p>\n<ul>\n<li>Commute (1 hour)</li>\n<li>Cook and eat (1 hour)</li>\n<li>Exercise (1 hour)</li>\n<li>Wind down (1 hour)</li>\n</ul>\n<p>That adds up to 4 hours. There’s no time left to do anything else. Of  course, these activities don’t always take an hour each, but you get the point. Winding down is especially important for me. I tried a lot of  ways to get around it, but I ended up not being able to sleep.</p>\n<p>To keep my sanity, I have dinner with friends on days I don’t exercise.  Still, there’s a limited time I can spend with them (around 2 hours).</p>\n<p>It feels like I’m living in a box, but I can’t say it’s all been bad.  Being able to keep up this habit makes me feel eccentric and in some  way, special.</p>\n<p>I used to watch the <a href=\"https://www.youtube.com/watch?v=TRGCNlk4RS0\">life of bodybuilders</a> and wonder how they do it; all they do is eat, train and sleep. They don’t do anything else.</p>\n<p>Now I understand them. There’s a sense of purpose that comes with living in a box. You know you’re disciplining yourself for a goal.</p>\n<h6 id=\"Give-yourself-one-day-off-per-week\"><a href=\"#Give-yourself-one-day-off-per-week\" class=\"headerlink\" title=\"Give yourself one day off per week\"></a>Give yourself one day off per week</h6><p>I’ve found that if I mess up my sleep schedule one day a week, I can still  maintain it throughout the week. I tried sleeping late two or three days a week — it didn’t work. But one seems to be okay.</p>\n<p>I love going out at night, so I’ve given myself one day a week (usually Friday) to hang out with friends for longer.</p>\n<p>If this is something you need to do to wake up early, I suggest you set  rules for it, too. You’re less likely to fail with disciplined chaos  than pure chaos. Give yourself one day a week where you’re allowed to  break the rules to mitigate what you feel you are losing.</p>\n<h6 id=\"Compare-the-benefits-with-the-cost\"><a href=\"#Compare-the-benefits-with-the-cost\" class=\"headerlink\" title=\"Compare the benefits with the cost\"></a>Compare the benefits with the cost</h6><p>Ask yourself these two questions:</p>\n<ul>\n<li>What will I gain with the extra time in the morning?</li>\n<li>What will I lose with the lost time at night?</li>\n</ul>\n<p>Then ask yourself: “Do the benefits outweigh the costs?”</p>\n<p>If they don’t, then there’s probably no point in waking up early. If they  do, there are a few things that helped me that’ll probably help you.</p>\n<p>…</p>\n<h5 id=\"Focus-on-Sleeping-Time\"><a href=\"#Focus-on-Sleeping-Time\" class=\"headerlink\" title=\"Focus on Sleeping Time\"></a>Focus on Sleeping Time</h5><p>When I told myself I was going to wake up at 5 a.m. no matter what, I  failed. I’d do it if I slept too late. I’d do it if I stayed out late at night. I’d do it if I stayed up studying.</p>\n<p>This didn’t work. I don’t know what I was trying to do by trying to cheat the system, thinking my willpower was enough.</p>\n<p>This might work for people who have this habit already. But if you’re starting out, focus on one thing: sleeping time.</p>\n<h6 id=\"Get-enough-sleep\"><a href=\"#Get-enough-sleep\" class=\"headerlink\" title=\"Get enough sleep\"></a>Get enough sleep</h6><p>A common mistake people make is thinking they can sleep the same amount  as they usually do. For example, I only slept for 6 hours before, so I  thought I could sleep for 6 hours and still wake up early. This doesn’t  work because you end up sleeping in; it’s unlikely you have any  willpower when it’s pitch black outside.</p>\n<p>For the best chances at waking up early, set a goal for 8 hours of sleep. I want to wake up at 5 a.m., so my sleeping time is 9 p.m. (8 hours  before).</p>\n<h6 id=\"Sleep-more-than-needed-when-you-start\"><a href=\"#Sleep-more-than-needed-when-you-start\" class=\"headerlink\" title=\"Sleep more than needed (when you start)\"></a>Sleep more than needed (when you start)</h6><p>When I started, I didn’t set my alarm at 5 a.m. I set no alarm at all. With  drastic changes to your sleeping schedule, you’re going to need some  time to adjust. You initially need more sleep.</p>\n<p>You have the rest of your life to wake up early. Spend some time now  getting the habit into your routine. This is a marathon, not a sprint.</p>\n<p>Waking up early means waking up when it’s still dark. Give your body some time to adjust to the darkness. It took me about a week; it might be longer  or shorter for you.</p>\n<p>I naturally woke up earlier and earlier every day. Now I can successfully wake up at 5 a.m. every day.</p>\n<p>…</p>\n<h5 id=\"Don’t-Try-to-Change-Everything\"><a href=\"#Don’t-Try-to-Change-Everything\" class=\"headerlink\" title=\"Don’t Try to Change Everything\"></a>Don’t Try to Change Everything</h5><p>You can’t introduce too much change to your life at once. Changing your  sleeping pattern is a big change. I know you want to wake up and do  something productive right away. You want to do all the amazing things  you couldn’t do before.</p>\n<p>Be patient. If you don’t, you’re not going to be able to do any amazing things at all.</p>\n<h6 id=\"You-can’t-change-too-much-at-once\"><a href=\"#You-can’t-change-too-much-at-once\" class=\"headerlink\" title=\"You can’t change too much at once\"></a>You can’t change too much at once</h6><p>If it helps to get some empathy, imagine the life of someone who seriously needs help. An archetype would be the 30-year-old man-child who still  lives in his parents’ basement and plays video games all day.</p>\n<p>If you were giving him life advice, it would be something like:</p>\n<ul>\n<li>Get a job.</li>\n<li>Fix your diet.</li>\n<li>Go to the gym every day.</li>\n<li>Read books.</li>\n<li>Do a side project.</li>\n</ul>\n<p>Can you imagine how they would do that? They can’t do all of these things  at once! If you told them to change everything at once, it would be so  overwhelming they’d stay in their old habits. You’d have more compassion for them and help them make those changes over time.</p>\n<p>I can barely fix my diet and go to the gym at the same time, and I’d like to consider myself a healthily integrated member of society.</p>\n<p>Similarly, you should only change one thing at a time. For now, focus on getting to sleep early. That’s all.</p>\n<p>Slowly increase your productivity as you go. If your goal is to get work done  in the morning, start by doing 30 minutes of work, then an hour, and so  on.</p>\n<h6 id=\"Have-fun-in-the-morning-when-you-start\"><a href=\"#Have-fun-in-the-morning-when-you-start\" class=\"headerlink\" title=\"Have fun in the morning (when you start)\"></a>Have fun in the morning (when you start)</h6><p>If there’s a day you wake up feeling super motivated and ready to do work, then, by all means, do it. But if you don’t feel motivated at the  start, just have fun.</p>\n<p>I spent around two weeks waking up in the morning and watching TV shows,  YouTube or Twitch streams. It was actually fun — watching stuff when  nobody else was around.</p>\n<p>Eventually, I was ready to do work. Trust me, you’ll eventually be ready to do  work. There’s no way you’re going to wake up every morning to mess  around for the rest of your life (if your goal is to be productive);  it’ll feel like such a waste.</p>\n<p>…</p>\n<h5 id=\"Choose-a-Morning-Routine\"><a href=\"#Choose-a-Morning-Routine\" class=\"headerlink\" title=\"Choose a Morning Routine\"></a>Choose a Morning Routine</h5><p>Even after waking up early for months, I still have trouble getting out of  bed without my morning routine. I tried to skip it a few times, but it  felt wrong — as if my morning routine is part of the process of waking  up.</p>\n<p>A morning routine not only prepares you for the day, but it mesmerizes  you. Before my routine, I’m groggy and tired. After, I’m excited and  awake. It’s the closest thing to magic I’ve found.</p>\n<p>It’s like my brain is telling me: “now that you’ve completed the first task of the day, you’re ready to wake up.”</p>\n<p>I journal for my morning routine — specifically, I do morning pages. It’s an exercise from Julia Cameron’s <a href=\"https://www.goodreads.com/book/show/615570.The_Artist_s_Way\"><em>Artist’s Way</em></a> where you write 3 longhand pages without stopping to think. It’s  designed to unblock artists by teaching them that perfection isn’t  necessary to create.</p>\n<p>Instead of 3 A4 pages, I do 4 A5 pages. I don’t know if they’re the same  amount, but the exact amount of words you write doesn’t matter. It’s  pretty close though.</p>\n<p>I keep a journal and pen next to my bed. They’re the first thing I touch (after turning the lights on) after waking up.</p>\n<h6 id=\"A-routine-that-suits-you\"><a href=\"#A-routine-that-suits-you\" class=\"headerlink\" title=\"A routine that suits you\"></a>A routine that suits you</h6><p>You might already have a morning routine or have one in mind you want to try. Or you could also do morning pages.</p>\n<p>Here are some other practices I recommend for morning routines:</p>\n<ul>\n<li>Meditation</li>\n<li>Yoga</li>\n<li>Making tea</li>\n</ul>\n<p>The actual routine doesn’t matter — at least for waking up. You’ll get  different benefits from different routines but the goal is to help you  wake up. You want to teach your body what to do when you wake up.</p>\n<p>…</p>\n<h5 id=\"Get-an-Alarm-That-Works-for-You\"><a href=\"#Get-an-Alarm-That-Works-for-You\" class=\"headerlink\" title=\"Get an Alarm That Works for You\"></a>Get an Alarm That Works for You</h5><p>If there’s one piece of advice with alarms I would give, it’s this: don’t  use an alarm to wake you up; instead, use it as an insurance policy.</p>\n<p>When I first started using alarms, I used them to try to cheat sleep. When  you use alarms this way, you end up waking up groggy and tired because  you didn’t get enough sleep in the first place.</p>\n<p>If you don’t want to end up hating your alarm, make sure you set the time  to the time after you want to wake up. I set it 8.5 hours after my  bedtime and I wake up without it.</p>\n<h6 id=\"Experiment-with-alarms\"><a href=\"#Experiment-with-alarms\" class=\"headerlink\" title=\"Experiment with alarms\"></a>Experiment with alarms</h6><p>If you haven’t experimented with alarms before, you should. Different  alarms suit different people. Do a quick Google search for alarms.</p>\n<p>There are all sorts of alarms out there. There are smart alarms, alarms that  only work if you step out of your bed, and even phone apps where someone calls you to wake you up. The latter would never work for me, but I can see it working for someone very social.</p>\n<p>If you don’t want to do your own research, I have a recommendation for you.</p>\n<h6 id=\"Try-a-light-alarm\"><a href=\"#Try-a-light-alarm\" class=\"headerlink\" title=\"Try a light alarm\"></a>Try a light alarm</h6><p>I use a light alarm. A light alarm wakes you up with light before it  wakes you up with sound. It starts shining a light 30 minutes before the time you set and slowly gets brighter and brighter. This is useful for  early birds because it’s dark early in the morning.</p>\n<p>I set it at 5:30 a.m., which means it starts shining at 5 a.m. I never  wake up to the sound; I always wake up to the light. It hasn’t been easy to create this habit, but since I’ve made sure I get enough sleep  first, the light is enough—I never have a jarring sound wake me up.</p>\n<p>…</p>\n<h5 id=\"Sleep-Without-Your-Phone\"><a href=\"#Sleep-Without-Your-Phone\" class=\"headerlink\" title=\"Sleep Without Your Phone\"></a>Sleep Without Your Phone</h5><p>If you want a chance at being productive in the morning, you can’t sleep with your phone. It’s already hard to wake up before everyone else.  Don’t make it harder for yourself by giving yourself easy access to  addictive stimuli while you’re in bed.</p>\n<h6 id=\"A-boring-sleeping-environment\"><a href=\"#A-boring-sleeping-environment\" class=\"headerlink\" title=\"A boring sleeping environment\"></a>A boring sleeping environment</h6><p>Make your sleeping environment as boring as possible. You don’t want to have any excitement before you sleep or after you wake up.</p>\n<p>The most common culprit of entertainment in bed is the phone. If you have  something else that you love you use in bed like a tablet, I suggest you move that away too.</p>\n<p>There are two goals this achieves:</p>\n<ul>\n<li>Improves sleep</li>\n<li>Helps with getting out of bed</li>\n</ul>\n<h6 id=\"No-way-around-it\"><a href=\"#No-way-around-it\" class=\"headerlink\" title=\"No way around it\"></a>No way around it</h6><p>Before I put my phone in another room, I constantly checked it in bed. I would message my friends. I would check every social media app I had. I would watch YouTube to sleep. I thought it was good because I kept doing it  and I was so used to falling asleep with entertainment.</p>\n<p>As long as your phone is within reach when you wake up, there’s an  incredible temptation to use it in bed. I don’t know about you but I’ve  stayed in bed for hours mucking around on my phone.</p>\n<p>I have no self-control at all, so I control my environment.</p>\n<h6 id=\"Put-your-phone-in-another-room\"><a href=\"#Put-your-phone-in-another-room\" class=\"headerlink\" title=\"Put your phone in another room\"></a>Put your phone in another room</h6><p>It’s a simple idea, but not easy. It feels like you’re giving away your  baby. But the resistance is good. It means you’re killing an addiction.</p>\n<p>Choose a room with a place to charge your phone. This could be the living  room, kitchen, or in my case, a study room. Leave your phone there and  in the morning, check it after you’ve left your bed, not before.</p>\n<p>…</p>\n<h5 id=\"Use-Melatonin-as-Insurance\"><a href=\"#Use-Melatonin-as-Insurance\" class=\"headerlink\" title=\"Use Melatonin as Insurance\"></a>Use Melatonin as Insurance</h5><p>I’ve left the most controversial for last. If you don’t want to take any substances, you can skip this section.</p>\n<p>Melatonin is a natural hormone that regulates the sleep-wake cycle. Your body  produces it at night to help you sleep. But you can also take it as a  pill.</p>\n<p>You can get it in the United States without a prescription. Since melatonin is found in some foods, the U.S. Dietary Supplement Health and  Education Act of 1994 allows it to be sold as a dietary supplement.</p>\n<h6 id=\"Dosage\"><a href=\"#Dosage\" class=\"headerlink\" title=\"Dosage\"></a>Dosage</h6><p>A <a href=\"http://news.mit.edu/2001/melatonin-1017\">2001 study</a> found that the ideal dosage is 0.3 mg. The lowest amount of a melatonin dose I’ve found is 1mg. If you can find 0.3 mg, then good for you. I  use 1mg and cut it into half (0.5 mg). It’s not exactly 0.3 mg, but it  works for me. I’ve tried different dosages, including up to 10 mg, and  none of them worked as well as taking less.</p>\n<h6 id=\"Regulate-your-sleep-schedule\"><a href=\"#Regulate-your-sleep-schedule\" class=\"headerlink\" title=\"Regulate your sleep schedule\"></a>Regulate your sleep schedule</h6><p>If you don’t get to sleep on time consistently, melatonin isn’t going to save you. I tried to cheat the system. It didn’t work.</p>\n<p>Nevertheless, you’re sometimes going to fail. You might sleep too late. You might  have a coffee too late in the day. You might wake up in the afternoon  and have trouble sleeping early.</p>\n<p>I fail. I’m not a perfectly disciplined monk. When it happens, I take melatonin.</p>\n<p>Even though melatonin isn’t considered an addictive substance, be cautious.  There’s no evidence melatonin has dangerous effects, but you can build  up a tolerance for it.</p>\n<p>My recommendation is to use melatonin when you mess up your sleep schedule and can’t get to sleep at your bedtime because you’re too awake — but  don’t allow that to happen too often.</p>\n<p>…</p>\n<p>I said a lot about sleep. That’s because most of waking up early is  sleeping early, and it isn’t easy to sleep early. There are sacrifices  to be made. If you’re willing to make them, you can become an early  bird.</p>\n<p>There are glamorous parts to waking up early. You get to be productive. You  get the feeling of accomplishing something before anybody else does. You get hours of solitude in a solitude-deprived, technology-focused world. I love it.</p>\n<p>…</p>\n<h5 id=\"说明\"><a href=\"#说明\" class=\"headerlink\" title=\"说明\"></a>说明</h5><p><strong>参考文档</strong>：<a href=\"https://betterhumans.pub/how-to-wake-up-at-5-a-m-every-day-ceb02e29c802\">https://betterhumans.pub/how-to-wake-up-at-5-a-m-every-day-ceb02e29c802</a>.</p>\n","feature":true,"text":"——An unconventional and compassionate guide to becoming an early bird I thought I was destined to be a night owl forever. I’m no stranger to...","link":"","photos":[],"count_time":{"symbolsCount":"19k","symbolsTime":"18 mins."},"categories":[{"name":"medium","slug":"medium","count":7,"path":"api/categories/medium.json"}],"tags":[{"name":"blog","slug":"blog","count":9,"path":"api/tags/blog.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Clarify-Your-Purpose-for-Waking-Up-Early\"><span class=\"toc-text\">Clarify Your Purpose for Waking Up Early</span></a></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Understand-What-You-Gain-and-Lose\"><span class=\"toc-text\">Understand What You Gain and Lose</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#What-are-you-gain\"><span class=\"toc-text\">What are you gain?</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#What-are-you-lose\"><span class=\"toc-text\">What are you lose?</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Running-out-of-time\"><span class=\"toc-text\">Running out of time</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Give-yourself-one-day-off-per-week\"><span class=\"toc-text\">Give yourself one day off per week</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Compare-the-benefits-with-the-cost\"><span class=\"toc-text\">Compare the benefits with the cost</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Focus-on-Sleeping-Time\"><span class=\"toc-text\">Focus on Sleeping Time</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Get-enough-sleep\"><span class=\"toc-text\">Get enough sleep</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Sleep-more-than-needed-when-you-start\"><span class=\"toc-text\">Sleep more than needed (when you start)</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Don%E2%80%99t-Try-to-Change-Everything\"><span class=\"toc-text\">Don’t Try to Change Everything</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#You-can%E2%80%99t-change-too-much-at-once\"><span class=\"toc-text\">You can’t change too much at once</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Have-fun-in-the-morning-when-you-start\"><span class=\"toc-text\">Have fun in the morning (when you start)</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Choose-a-Morning-Routine\"><span class=\"toc-text\">Choose a Morning Routine</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#A-routine-that-suits-you\"><span class=\"toc-text\">A routine that suits you</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Get-an-Alarm-That-Works-for-You\"><span class=\"toc-text\">Get an Alarm That Works for You</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Experiment-with-alarms\"><span class=\"toc-text\">Experiment with alarms</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Try-a-light-alarm\"><span class=\"toc-text\">Try a light alarm</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Sleep-Without-Your-Phone\"><span class=\"toc-text\">Sleep Without Your Phone</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#A-boring-sleeping-environment\"><span class=\"toc-text\">A boring sleeping environment</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#No-way-around-it\"><span class=\"toc-text\">No way around it</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Put-your-phone-in-another-room\"><span class=\"toc-text\">Put your phone in another room</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#Use-Melatonin-as-Insurance\"><span class=\"toc-text\">Use Melatonin as Insurance</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Dosage\"><span class=\"toc-text\">Dosage</span></a></li><li class=\"toc-item toc-level-6\"><a class=\"toc-link\" href=\"#Regulate-your-sleep-schedule\"><span class=\"toc-text\">Regulate your sleep schedule</span></a></li></ol></li><li class=\"toc-item toc-level-5\"><a class=\"toc-link\" href=\"#%E8%AF%B4%E6%98%8E\"><span class=\"toc-text\">说明</span></a></li></ol>","author":{"name":"Everett327","slug":"blog-author","avatar":"https://img-blog.csdnimg.cn/20210313122054101.png","link":"/","description":"人生就在不断地选择之中","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"mapped":true,"prev_post":{"title":"One Honest Reason Why Your Life Is So Boring","uid":"c3f41bee94aa6064f45501e2f6ecc403","slug":"One-Honest-Reason-Why-Your-Life-Is-So-Boring","date":"2022-04-26T08:47:26.000Z","updated":"2022-04-26T08:59:35.960Z","comments":true,"path":"api/articles/One-Honest-Reason-Why-Your-Life-Is-So-Boring.json","keywords":"博客","cover":null,"text":"Before I set my foot on the self-development journey, I’m like most people. Sleeping late and waking up late, being on social media for an u...","link":"","photos":[],"count_time":{"symbolsCount":"5.4k","symbolsTime":"5 mins."},"categories":[{"name":"medium","slug":"medium","count":7,"path":"api/categories/medium.json"}],"tags":[{"name":"blog","slug":"blog","count":9,"path":"api/tags/blog.json"}],"author":{"name":"Everett327","slug":"blog-author","avatar":"https://img-blog.csdnimg.cn/20210313122054101.png","link":"/","description":"人生就在不断地选择之中","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"feature":true},"next_post":{"title":"A Monk Taught Me How to Focus","uid":"c82e7a9e39f525c73dd3316c9fdaebd8","slug":"A-Monk-Taught-Me-How-to-Focus","date":"2022-04-26T08:06:53.000Z","updated":"2022-04-26T08:50:28.440Z","comments":true,"path":"api/articles/A-Monk-Taught-Me-How-to-Focus.json","keywords":"博客","cover":null,"text":"A very simple 3 step procedure by which I have been able to focus on my work. People, one of the most powerful things in the history of mank...","link":"","photos":[],"count_time":{"symbolsCount":"8.4k","symbolsTime":"8 mins."},"categories":[{"name":"medium","slug":"medium","count":7,"path":"api/categories/medium.json"}],"tags":[{"name":"blog","slug":"blog","count":9,"path":"api/tags/blog.json"}],"author":{"name":"Everett327","slug":"blog-author","avatar":"https://img-blog.csdnimg.cn/20210313122054101.png","link":"/","description":"人生就在不断地选择之中","socials":{"github":"","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}}}}